[Killed] BlockStatement
main/components/Driver/DriverAvailabilityTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/availability/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: DriverAvailabilityTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/availability/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityTable.js:34:21
 
     const columns = [
         {
-            Header: 'Id',
+            Header: "",
             accessor: 'id', // accessor is the "key" in the data
         },
killedBy: DriverAvailabilityTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityTable.js:37:9
             Header: 'Id',
             accessor: 'id', // accessor is the "key" in the data
         },
-        {
-            Header: 'Driver Id',
-            accessor: 'driverId',
-            Cell: ({ value }) => (
-                // Stryker disable next-line all : hard to set up test
-                <Link to={`/driverInfo/${value}`}>{value}</Link>
-              ),
-        },
+        {},
         {
             Header: 'Day',
killedBy: DriverAvailabilityTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Driver/DriverAvailabilityTable.js:40:19
         {
             Header: 'Driver Id',
             accessor: 'driverId',
-            Cell: ({ value }) => (
-                // Stryker disable next-line all : hard to set up test
-                <Link to={`/driverInfo/${value}`}>{value}</Link>
-              ),
+            Cell: () => undefined,
         },
         {
killedBy: DriverAvailabilityIndexPage tests fetches driverAvailabilities using the correct GET method
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityTable.js:58:21
             accessor: 'endTime',
         },
         {
-            Header: 'Notes',
+            Header: "",
             accessor: 'notes',
         }
killedBy: DriverAvailabilityTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Notes. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Timeout] StringLiteral
main/components/Driver/DriverAvailabilityTable.js:77:17
     return <OurTable
         data={Availability}
         columns={columnsToDisplay}
-        testid={"DriverAvailabilityTable"}
+        testid={""}
     />;
 };
