[Killed] BlockStatement
main/components/Driver/DriverAvailabilityForm.js:26:40
 
   return (
     <Form
-      onSubmit={handleSubmit((data) => {
-        const { driverId, ...filteredData } = data;
-        submitAction(filteredData);
-      })}
+      onSubmit={handleSubmit((data) => {})}
     >
       {initialContents && (
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Driver/DriverAvailabilityForm.js:31:8
         submitAction(filteredData);
       })}
     >
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">ID</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: DriverAvailabilityForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Driver/DriverAvailabilityForm.js:31:8
         submitAction(filteredData);
       })}
     >
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">ID</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">ID</Form.Label>
+          <Form.Control data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:51:31
           data-testid={testIdPrefix + "-day"}
           id="day"
           isInvalid={Boolean(errors.day)}
-          {...register("day", {
-            required: "Day of the Week is required.",
-          })}
+          {...register("day", {})}
         >
           <option value="">Select a Day</option>
killedBy: DriverAvailabilityForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Day of the Week is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Driver/DriverAvailabilityForm.js:52:23
           id="day"
           isInvalid={Boolean(errors.day)}
           {...register("day", {
-            required: "Day of the Week is required.",
+            required: "",
           })}
         >
killedBy: DriverAvailabilityForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Day of the Week is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Survived] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:79:22
           isInvalid={Boolean(errors.startTime)}
           {...register("startTime", {
             required: "Start Time is required.",
-            pattern: {
-              value: time_regex,
-              message: "Invalid time format. Use HH:MM AM/PM.",
-            },
+            pattern: {},
           })}
         />

[Survived] ObjectLiteral
main/components/Driver/DriverAvailabilityForm.js:100:22
           isInvalid={Boolean(errors.endTime)}
           {...register("endTime", {
             required: "End Time is required.",
-            pattern: {
-              value: time_regex,
-              message: "Invalid time format. Use HH:MM AM/PM.",
-            },
+            pattern: {},
           })}
         />
