[Killed] ArrowFunction
main/components/Ride/RideAssignDriverForm.js:98:33
                     {...register("shiftId")}
                     defaultValue={initialContents?.shiftId}
                 >
-                    {Shifts.map((shift) => (
-                        <option key={shift.id} data-testid={testIdPrefix + "-shiftId-" + shift.id} value={shift.id}>
-                           {shift.id} - {shift.driver} - {shift.day} {shift.shiftStart}-{shift.shiftEnd}
-                        </option>
-                    ))}
+                    {Shifts.map(() => undefined)}
                 </Form.Select>
             </Form.Group>
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(element).toHaveValue(1)

Expected the element to have value:
  1
Received:
  undefined

[Killed] StringLiteral
main/components/Ride/RideAssignDriverForm.js:112:34
                     data-testid={testIdPrefix + "-day"}
                     id="day"
                     isInvalid={Boolean(errors.day)}
-                    {...register("day")}
+                    {...register("")}
                     disabled
                     defaultValue={initialContents?.day}
killedBy: RideRequestAssignPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
