[Killed] BlockStatement
main/components/Ride/RideTable.js:191:34
         {
             Header: 'Assigned',
             accessor: 'shiftId',
-            Cell: ({ value }) => {
-              const stringValue = String(value);
-              if (stringValue === "") {
-                return "empty";
-              } else if (stringValue === "0") {
-                return "Unassigned";
-              } else {
-                return "Assigned";
-              }
-            },
+            Cell: ({ value }) => {},
         }
     ];
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/components/Ride/RideTable.js:193:39
             accessor: 'shiftId',
             Cell: ({ value }) => {
               const stringValue = String(value);
-              if (stringValue === "") {
-                return "empty";
-              } else if (stringValue === "0") {
+              if (stringValue === "") {} else if (stringValue === "0") {
                 return "Unassigned";
               } else {
killedBy: RideTable tests Assigned column displays correct text based on shiftId
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ConditionalExpression
main/components/Ride/RideTable.js:193:19
             accessor: 'shiftId',
             Cell: ({ value }) => {
               const stringValue = String(value);
-              if (stringValue === "") {
+              if (false) {
                 return "empty";
               } else if (stringValue === "0") {
killedBy: RideTable tests Assigned column displays correct text based on shiftId
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  empty
Received:
  Assigned

[Killed] ConditionalExpression
main/components/Ride/RideTable.js:195:26
               const stringValue = String(value);
               if (stringValue === "") {
                 return "empty";
-              } else if (stringValue === "0") {
+              } else if (false) {
                 return "Unassigned";
               } else {
killedBy: RideTable tests Assigned column displays correct text based on shiftId
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Unassigned
Received:
  Assigned

[Killed] EqualityOperator
main/components/Ride/RideTable.js:195:26
               const stringValue = String(value);
               if (stringValue === "") {
                 return "empty";
-              } else if (stringValue === "0") {
+              } else if (stringValue !== "0") {
                 return "Unassigned";
               } else {
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Assigned
Received:
  Unassigned

[Killed] StringLiteral
main/components/Ride/RideTable.js:196:24
               if (stringValue === "") {
                 return "empty";
               } else if (stringValue === "0") {
-                return "Unassigned";
+                return "";
               } else {
                 return "Assigned";
killedBy: RideTable tests Assigned column displays correct text based on shiftId
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Unassigned
Received:

[Killed] BlockStatement
main/components/Ride/RideTable.js:197:22
                 return "empty";
               } else if (stringValue === "0") {
                 return "Unassigned";
-              } else {
-                return "Assigned";
-              }
+              } else {}
             },
         }
killedBy: RideTable tests Has the expected column headers and content for ordinary rider
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
