[Killed] StringLiteral
main/components/Shift/ShiftForm.js:26:26
     // Stryker restore all
 
     const navigate = useNavigate();
-    const testIdPrefix = "ShiftForm";
+    const testIdPrefix = "";
 
     return (
killedBy: ShiftForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="ShiftForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:50:49
                 <Form.Label htmlFor="day">Day of the Week</Form.Label>
                 <Form.Control 
                     as="select"
-                    data-testid={testIdPrefix + "-day"}
+                    data-testid={testIdPrefix + ""}
                     id="day"
                     name="day"
killedBy: ShiftForm tests renders data-testid attributes
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftForm-day"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:119:49
             <Form.Group className="mb-3">
                 <Form.Label htmlFor="driverID">Driver ID</Form.Label>
                 <Form.Select
-                    data-testid={testIdPrefix + "-driverID"}
+                    data-testid={testIdPrefix + ""}
                     id="driverID"
                     name="driverID"
killedBy: ShiftForm tests renders data-testid attributes
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftForm-driverID"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ArrowFunction
main/components/Shift/ShiftForm.js:124:41
                     name="driverID"
                     {...register("driverID")}
                 >
-                {drivers && drivers.map((driver) => (
-                    <option key={driver.id} data-testid={testIdPrefix + "-driverId-" + driver.id} value={driver.id.toString()}>{driver.id} - {driver.fullName}</option>
-                ))
+                {drivers && drivers.map(() => undefined)
                 }
                 </Form.Select>
killedBy: ShiftForm tests renders correctly when passing in initialContents
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftForm-driverId-1"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Shift/ShiftForm.js:124:18
                     name="driverID"
                     {...register("driverID")}
                 >
-                {drivers && drivers.map((driver) => (
-                    <option key={driver.id} data-testid={testIdPrefix + "-driverId-" + driver.id} value={driver.id.toString()}>{driver.id} - {driver.fullName}</option>
-                ))
+                {false
                 }
                 </Form.Select>
killedBy: ShiftForm tests renders correctly when passing in initialContents
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftForm-driverId-1"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Shift/ShiftForm.js:134:49
             <Form.Group className="mb-3">
                 <Form.Label htmlFor="driverBackupID">Driver Backup ID</Form.Label>
                 <Form.Select
-                    data-testid={testIdPrefix + "-driverBackupID"}
+                    data-testid={testIdPrefix + ""}
                     id="driverBackupID"
                     name="driverBackupID"
killedBy: ShiftForm tests renders data-testid attributes
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftForm-driverBackupID"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ArrowFunction
main/components/Shift/ShiftForm.js:139:41
                     name="driverBackupID"
                     {...register("driverBackupID")}
                 >
-                {drivers && drivers.map((driver) => (
-                    <option key={driver.id} data-testid={testIdPrefix + "-driverBackupId-" + driver.id}  value={driver.id.toString()}>{driver.id} - {driver.fullName}</option>
-                ))}
+                {drivers && drivers.map(() => undefined)}
                 </Form.Select>
             </Form.Group>
killedBy: ShiftForm tests renders correctly when passing in initialContents
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftForm-driverBackupId-1"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Shift/ShiftForm.js:139:18
                     name="driverBackupID"
                     {...register("driverBackupID")}
                 >
-                {drivers && drivers.map((driver) => (
-                    <option key={driver.id} data-testid={testIdPrefix + "-driverBackupId-" + driver.id}  value={driver.id.toString()}>{driver.id} - {driver.fullName}</option>
-                ))}
+                {true}
                 </Form.Select>
             </Form.Group>
killedBy: ShiftForm tests renders correctly when passing in initialContents
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ShiftForm-driverBackupId-1"]

<body>
  <div>
    <form
      class=""
    >
      <div
