[Killed] StringLiteral
main/components/Users/UsersTable.js:9:44
 
 export default function UsersTable({ users}) {
     // const [sortedUsers, setSortedUsers] = useState(users);
-    const [sort, ] = useState({ keyToSort: 'id'});
+    const [sort, ] = useState({ keyToSort: ""});
 
     // useEffect(() => {
killedBy: UserTable tests initial state of sort should be { keyToSort: "id", direction: "asc" }
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
  2
