[Killed] StringLiteral
main/components/Users/UsersTable.js:9:44
 
 export default function UsersTable({ users}) {
     // const [sortedUsers, setSortedUsers] = useState(users);
-    const [sort, ] = useState({ keyToSort: 'id', direction: 'asc' });
+    const [sort, ] = useState({ keyToSort: "", direction: 'asc' });
 
     // useEffect(() => {
killedBy: UserTable tests initial state of sort should be { keyToSort: "id", direction: "asc" }
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
  2

[Killed] BlockStatement
main/components/Users/UsersTable.js:15:49
     //     setSortedUsers(sortTableById(users, sort));
     // }, [users, sort]);
 
-    function cellToAxiosParamsToggleRider(cell) {
-        return {
-            url: "/api/admin/users/toggleRider",
-            method: "POST",
-            params: {
-                id: cell.row.values.id
-            }
-        }
-    }
+    function cellToAxiosParamsToggleRider(cell) {}
     // Stryker disable all : hard to test for query caching
     const toggleRiderMutation = useBackendMutation(
killedBy: AdminUsersPage tests usertable toggle rider tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
